# yolov8_dpe.yaml (修正版 - 强制 Small 规模 + 修复通道参数)
nc: 80
# ⚠️ 关键修改：直接指定 Small 版本的缩放因子，防止默认为 Nano
depth_multiple: 0.33
width_multiple: 0.50

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0
  - [-1, 1, DPE, [64]]         # 1 ⚠️ 关键修改：这里必须填 [64]，否则报错
  - [-1, 1, Conv, [128, 3, 2]] # 2
  - [-1, 3, C2f, [128, True]]  # 3
  - [-1, 1, Conv, [256, 3, 2]] # 4
  - [-1, 6, C2f, [256, True]]  # 5
  - [-1, 1, Conv, [512, 3, 2]] # 6
  - [-1, 6, C2f, [512, True]]  # 7
  - [-1, 1, Conv, [1024, 3, 2]] # 8
  - [-1, 3, C2f, [1024, True]] # 9
  - [-1, 1, SPPF, [1024, 5]]   # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # 12: cat P4
  - [-1, 3, C2f, [512]]        # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # 15: cat P3
  - [-1, 3, C2f, [256]]        # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # 18
  - [-1, 3, C2f, [512]]        # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # 21
  - [-1, 3, C2f, [1024]]       # 22

  - [[16, 19, 22], 1, Detect, [nc]]