# yolov8_light.yaml (Clean Version - Forced Small Scale)
nc: 80
# Explicitly define S-version scaling factors
depth_multiple: 0.33
width_multiple: 0.50

# ⚠️ 注意：这里不要写 scales 字典了，删掉它

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f_Faster, [128, True]] # 替换
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f_Faster, [256, True]] # 替换
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f_Faster, [512, True]] # 替换
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f_Faster, [1024, True]] # 替换
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [512]] # 替换
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [256]] # 替换
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [512]] # 替换
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [1024]] # 替换
  - [[15, 18, 21], 1, Detect, [nc]]