# PC-YOLO: Physics-Cognitive Lightweight YOLO
# 优化目标：极致降低 GFLOPs

# Parameters
nc: 80
scales:
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2

  # 物理感知模块 (DPE) - 放在最前面，处理原始特征
  - [-1, 1, DPE, [64]]         # 1

  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/4

  # 【关键】把所有的 C2f 全部换成 C2f_Faster
  - [-1, 3, C2f_Faster, [128, True]] # 3

  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 6, C2f_Faster, [256, True]] # 5

  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 6, C2f_Faster, [512, True]] # 7

  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 3, C2f_Faster, [1024, True]] # 9

  # 认知注意力模块 (BLCA) - 放在深层，处理语义
  - [-1, 1, BLCA, [1024]]       # 10

  - [-1, 1, SPPF, [1024, 5]]    # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4 (注意索引是 7)
  - [-1, 3, C2f_Faster, [512]] # 14 - Head 也用 C2f_Faster

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3 (注意索引是 5)
  - [-1, 3, C2f_Faster, [256]] # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f_Faster, [512]] # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P5 (注意索引是 11)
  - [-1, 3, C2f_Faster, [1024]] # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)